import os
import typing as t

from layers.dm.transform_rules import DMTransformRules


tables: t.List[str] = [
    'сотрудники_дар',
    'базы_данных',
    'инструменты',
    'платформы',
    'среды_разработки',
    'технологии',
    'типы_систем',
    'уровни_знаний',
    'фреймворки',
    'языки_программирования',
    'базы_данных_и_уровень_знаний_сотру',
    'инструменты_и_уровень_знаний_сотр',
    'платформы_и_уровень_знаний_сотруд',
    'среды_разработки_и_уровень_знаний_',
    'технологии_и_уровень_знаний_сотру',
    'типы_систем_и_уровень_знаний_сотру',
    'фреймворки_и_уровень_знаний_сотру',
    'языки_программирования_и_уровень']

path_to_sql_query_for_creating_layer: str = os.path.join(
    os.path.dirname(__file__), 'dm_create.sql'
)

rules = DMTransformRules()
