SELECT группы_навыков_и_уровень_знаний_сотруд_dm('инструменты_и_уровень_знаний_сотр', 'инструменты', 'инструменты', 1);
SELECT группы_навыков_и_уровень_знаний_сотруд_dm('базы_данных_и_уровень_знаний_сотру', 'Базы данных', 'базы_данных', 2);
SELECT группы_навыков_и_уровень_знаний_сотруд_dm('платформы_и_уровень_знаний_сотруд', 'платформы', 'платформы', 3);
SELECT группы_навыков_и_уровень_знаний_сотруд_dm('среды_разработки_и_уровень_знаний_', 'Среды разработки', 'среды_разработки', 4);
SELECT группы_навыков_и_уровень_знаний_сотруд_dm('типы_систем_и_уровень_знаний_сотру', 'Типы систем', 'типы_систем', 5);
SELECT группы_навыков_и_уровень_знаний_сотруд_dm('фреймворки_и_уровень_знаний_сотру', 'фреймворки', 'фреймворки', 6);
SELECT группы_навыков_и_уровень_знаний_сотруд_dm('языки_программирования_и_уровень', 'Языки программирования', 'языки_программирования', 7);
SELECT группы_навыков_и_уровень_знаний_сотруд_dm('технологии_и_уровень_знаний_сотру', 'технологии', 'технологии', 8);